/**
 * Test suite.
 */

import { $gzip } from '#index.ts';
import { describe, expect, test } from 'vitest';

describe('$gzip', async () => {
    test('.encode()', async () => {
        expect(await $gzip.encode('ꓺ💡abcdefghijklmnopqrstuvwxyzꓺ0123456789')).toStrictEqual(
            new Uint8Array([
                31, 139, 8, 0, 0, 0, 0, 0, 0, 19, 123, 53, 121, 215, 135, 249, 147, 22, 38, 38, 37, 167, 164, 166, 165, 103, 100, 102, 101, 231, 228, 230, 229, 23, 20, 22, 21, 151,
                148, 150, 149, 87, 84, 86, 189, 154, 188, 203, 192, 208, 200, 216, 196, 212, 204, 220, 194, 18, 0, 235, 185, 56, 236, 46, 0, 0, 0,
            ]),
        );
    });
    test('.decode()', async () => {
        expect(
            await $gzip.decode(
                new Uint8Array([
                    31, 139, 8, 0, 0, 0, 0, 0, 0, 19, 123, 53, 121, 215, 135, 249, 147, 22, 38, 38, 37, 167, 164, 166, 165, 103, 100, 102, 101, 231, 228, 230, 229, 23, 20, 22, 21,
                    151, 148, 150, 149, 87, 84, 86, 189, 154, 188, 203, 192, 208, 200, 216, 196, 212, 204, 220, 194, 18, 0, 235, 185, 56, 236, 46, 0, 0, 0,
                ]),
            ),
        ).toBe('ꓺ💡abcdefghijklmnopqrstuvwxyzꓺ0123456789');
    });
});
